// Задачник Абрамяна - задача If11
//
//Даны две переменные целого типа: A и B. Если их значения не равны, то
//присвоить каждой переменной большее из этих значений, а если равны,
//то присвоить переменным нулевые значения. Вывести новые значения
//переменных A и B
// 
// Решение Урсу Артёма

#include <stdio.h>
int main (){
	int a,b;
	scanf("%d %d",&a,&b);
	
	if (a>b){
		b=a;
		printf ("%d\n",a);
		printf ("%d",b);
	}
	
	else if (b>a){
		a=b;
		printf ("%d\n",a);
		printf ("%d",b);
	}

	else if (a==b){
		b=0;
		a=0;
		printf ("%d\n",a);
		printf ("%d",b);
	}
	
	
	return 0;
}
