// Задачник Абрамяна - задача If3
//
//Дано целое число. Если оно является положительным, то прибавить к
//нему 1; если отрицательным, то вычесть из него 2; если нулевым, то
//заменить его на 10. Вывести полученное число.
// 
// Решение Урсу Артёма


#include <stdio.h>
int main (){
	
	int n1,res;
	scanf ("%d",&n1);
	
	if (n1>0) {
		res = n1+1;
		printf ("%d\n",res);
		return 0;
	}
		else if (n1==0) {
		res = 10;
		printf ("%d\n",res);
		return 0;
	}
		
	
		else{ 
			res = n1-2;
			printf ("%d\n",res);
		}
	
	return 0;
}
